In [1]:
import numpy as np
import pandas as pd

In [3]:
df1 = pd.DataFrame({"A": [1, 2, 3], "B": [4, 5, 6], }, index=[19, 20, 21])
df2 = pd.DataFrame({"C": ["a", "b", "c"], "D": [
                   "d", "e", "f"], }, index=[20, 21, 22])

# Uni√£o de dataFrames

In [4]:
df1

    A  B
19  1  4
20  2  5
21  3  6

In [5]:
df2

    C  D
20  a  d
21  b  e
22  c  f

In [7]:
# indices independentes
pd.concat([df1, df2])

      A    B    C    D
19  1.0  4.0  NaN  NaN
20  2.0  5.0  NaN  NaN
21  3.0  6.0  NaN  NaN
20  NaN  NaN    a    d
21  NaN  NaN    b    e
22  NaN  NaN    c    f

In [9]:
# uni os indices 
pd.concat([df1, df2], axis=1)

      A    B    C    D
19  1.0  4.0  NaN  NaN
20  2.0  5.0    a    d
21  3.0  6.0    b    e
22  NaN  NaN    c    f

In [13]:
# dataframe de origin no caso df1
df1.join(df2)

    A  B    C    D
19  1  4  NaN  NaN
20  2  5    a    d
21  3  6    b    e

In [14]:
df1.join(df2, how="outer")

      A    B    C    D
19  1.0  4.0  NaN  NaN
20  2.0  5.0    a    d
21  3.0  6.0    b    e
22  NaN  NaN    c    f

In [15]:
# tirar os nan
df1.join(df2, how="outer").fillna(0)

      A    B  C  D
19  1.0  4.0  0  0
20  2.0  5.0  a  d
21  3.0  6.0  b  e
22  0.0  0.0  c  f

In [17]:
# media e coloca no nan
df1.join(df2, how="outer").fillna(df1["A"].mean())

      A    B    C    D
19  1.0  4.0  2.0  2.0
20  2.0  5.0    a    d
21  3.0  6.0    b    e
22  2.0  2.0    c    f

# Filtros

In [18]:
df1["C"] = [8,10,12]

In [20]:
df1.loc[22] = [13,16,19]

In [21]:
df1

     A   B   C
19   1   4   8
20   2   5  10
21   3   6  12
22  13  16  19

In [23]:
df1["A"]>2

19    False
20    False
21     True
22     True
Name: A, dtype: bool

In [24]:
df1[df1["A"]>2]

     A   B   C
21   3   6  12
22  13  16  19

In [25]:
df1[(df1["A"]>2) & (df1["C"] > 15)]

     A   B   C
22  13  16  19

In [26]:
df1[df1["B"] == 6]

    A  B   C
21  3  6  12

In [27]:
df1[(df1["A"]>2) | (df1["C"] > 15)]

     A   B   C
21   3   6  12
22  13  16  19

# Fun√ß√£o Apply

In [28]:
df1

     A   B   C
19   1   4   8
20   2   5  10
21   3   6  12
22  13  16  19

In [30]:
# pegar cada elemento e multiplicar por 3
df1.apply(lambda x : x * 3)

     A   B   C
19   3  12  24
20   6  15  30
21   9  18  36
22  39  48  57

In [31]:
df1

     A   B   C
19   1   4   8
20   2   5  10
21   3   6  12
22  13  16  19

In [35]:
def maioresCincoA(x):
    if x > 5:
        return True
    else:
        return False

df1["Maiores"] =  df1["A"].apply(maioresCincoA)

In [36]:
df1

     A   B   C  Maiores
19   1   4   8    False
20   2   5  10    False
21   3   6  12    False
22  13  16  19     True

In [37]:
def maioresCincoA(x):
    if x > 5:
        return True
    else:
        return False

df1["A"] =  df1["A"].apply(maioresCincoA)

In [38]:
df1

        A   B   C  Maiores
19  False   4   8    False
20  False   5  10    False
21  False   6  12    False
22   True  16  19     True